package uz.silence.practice_4_5

import android.annotation.SuppressLint
import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import uz.silence.practice_4_5.databinding.ActivityMainScrollViewBinding

class MainActivityScrollView : AppCompatActivity() {

    protected lateinit var bindingSV: ActivityMainScrollViewBinding

    @SuppressLint("SetTextI18n")
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        bindingSV = ActivityMainScrollViewBinding.inflate(layoutInflater)
        setContentView(bindingSV.root)


        bindingSV.buttonS.setOnClickListener {
            bindingSV.scrollV.scrollBy(0,40)
        }

        bindingSV.texId.text = "“Энг қулай вақт – ҳозир”\n" +
                "\n" +
                "Жанубий Кореянинг Жэонбук университетида иқтисодиёт бўйича магистрант даражасини олган Миркомил Холбоев Kun.uz билан суҳбатда энергетика ислоҳотини ортиқ кечиктирмаслик зарурати ҳақида сўз юритди.\n" +
                "\n" +
                "— Энергетика ислоҳотларини амалга ошириш ва нархларини эркинлаштириш учун энг яхши пайт – ҳозир. Яъни кеча ҳам яхши вақт эди, ҳозир ҳам шундай. Йўқотиш йилдан йилга ошиб бораверади, ислоҳотни амалга оширмаслик эса йўқотишларни ҳеч қанақасига камайтирмайди.\n" +
                "\n" +
                "Энергия нархлари ўзгариши иқтисодиётга бир нечта сигнал беради, бу эса бозор иштирокчилари қарорларини ўзгартиришига ҳам таъсир ўтказади. Ислоҳот биринчи навбатда энергия ресурслари самарадорлигига олиб келади. Истеъмол қилувчилар: ҳам бизнес вакиллари, ҳам оддий аҳоли қатлами тежамкорлик режимига ўта бошлайди. Ҳозирги субсидия асосида тақдим қилинаётган энергиядан фойдаланишда тежамкорлик нуқтайи назаридан рағбат мавжуд эмас. Сув ресурслари ҳам шунақа. Субсидия асосида фермер хўжаликларига тақдим этилгани боис сув ресурсларимиз ҳаддан зиёд танқис бўлса ҳам исрофгарчилик даражаси жуда ҳам баланд.\n" +
                "\n" +
                "Бундан ташқари, Ўзбекистон ялпи ички маҳсулотининг сезиларли қисми (2020 йилдаги статистик маълумотлар бўйича 6,6 фоиз) энергия ресурсларини субсидиялаш учун сарфланади. Бу эса давлат маблағлари самарасиз сарф қилинишига олиб келаверади ва алтернатив равишда ушбу маблағларнинг нисбатан анчайин фойдалироқ бошқа соҳаларга (хусусан, таълим ва тиббиёт) йўналтирилишига имкон бермайди." +
                "“Энг қулай вақт – ҳозир”\n" +
                "\n" +
                "Жанубий Кореянинг Жэонбук университетида иқтисодиёт бўйича магистрант даражасини олган Миркомил Холбоев Kun.uz билан суҳбатда энергетика ислоҳотини ортиқ кечиктирмаслик зарурати ҳақида сўз юритди.\n" +
                "\n" +
                "— Энергетика ислоҳотларини амалга ошириш ва нархларини эркинлаштириш учун энг яхши пайт – ҳозир. Яъни кеча ҳам яхши вақт эди, ҳозир ҳам шундай. Йўқотиш йилдан йилга ошиб бораверади, ислоҳотни амалга оширмаслик эса йўқотишларни ҳеч қанақасига камайтирмайди.\n" +
                "\n" +
                "Энергия нархлари ўзгариши иқтисодиётга бир нечта сигнал беради, бу эса бозор иштирокчилари қарорларини ўзгартиришига ҳам таъсир ўтказади. Ислоҳот биринчи навбатда энергия ресурслари самарадорлигига олиб келади. Истеъмол қилувчилар: ҳам бизнес вакиллари, ҳам оддий аҳоли қатлами тежамкорлик режимига ўта бошлайди. Ҳозирги субсидия асосида тақдим қилинаётган энергиядан фойдаланишда тежамкорлик нуқтайи назаридан рағбат мавжуд эмас. Сув ресурслари ҳам шунақа. Субсидия асосида фермер хўжаликларига тақдим этилгани боис сув ресурсларимиз ҳаддан зиёд танқис бўлса ҳам исрофгарчилик даражаси жуда ҳам баланд.\n" +
                "\n" +
                "Бундан ташқари, Ўзбекистон ялпи ички маҳсулотининг сезиларли қисми (2020 йилдаги статистик маълумотлар бўйича 6,6 фоиз) энергия ресурсларини субсидиялаш учун сарфланади. Бу эса давлат маблағлари самарасиз сарф қилинишига олиб келаверади ва алтернатив равишда ушбу маблағларнинг нисбатан анчайин фойдалироқ бошқа соҳаларга (хусусан, таълим ва тиббиёт) йўналтирилишига имкон бермайди."

    }
}